{
  "_name_or_path": "ckiplab/albert-base-chinese-ner",
  "architectures": [
    "AlbertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 101,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 102,
  "gap_size": 0,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "id2label": {
    "0": "B-movie",
    "1": "I-movie",
    "2": "I-picture",
    "3": "O",
    "4": "B-music",
    "5": "I-text",
    "6": "I-music",
    "7": "B-picture",
    "8": "B-text"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 3072,
  "label2id": {
    "B-movie": 0,
    "B-music": 4,
    "B-picture": 7,
    "B-text": 8,
    "I-movie": 1,
    "I-music": 6,
    "I-picture": 2,
    "I-text": 5,
    "O": 3
  },
  "layer_norm_eps": 1e-12,
  "layers_to_keep": [],
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 12,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tokenizer_class": "BertTokenizerFast",
  "torch_dtype": "float32",
  "transformers_version": "4.30.1",
  "type_vocab_size": 2,
  "vocab_size": 21128
}
